tutorials/FF/interFoam-interFoam/pimpleFoam-pimpleFoam/Fluid1/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            fixedGradient;
        gradient        uniform (0 0 0);
    }
    fixedWalls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
